/******************************************************************************
(С) ООО "ЛМТ", Санкт-Петербург, Россия, 2002.
http://lmt.cs.ifmo.ru, tel.: +7-812-233-3096,
mailto: lmt@d1.ifmo.ru

Данный файл является свободно распространяемым примером работы
с интерфейсом I2C учебного стенда SDK-1.1 на языке Си (компилятор
Keil C фирмы KEIL ELEKTRONIK GmbH) и предназначен для иллюстрации
взаимодействия через интерфейс со slave-устройствами.
Данный программный модуль не подвергался тщательному
тестированию и может содержать ошибки. Авторы не несут 
ответственности за потерю информации и иные возможные вредные
последствия использования данного программного модуля в составе
программных проектов.
Данный файл может подвергаться любым изменениям, но не может
распространяться в коммерческих целях и в составе коммерческих
программных продуктов.


Файл: i2c.c
Версия: 1.0.0
Автор: LAN
Описание: Набор демонстрационного программного обеспечения для стенда
SDK-1.1. Обмен по интерфейсу i2c в режиме Master.

Изменения:
-------------------------------------------------------------------------------
N Дата Версия Автор Описание 
-------------------------------------------------------------------------------
1 10.04.02 1.0.0 LAN Создан
******************************************************************************/

#include "ADuC812.h"
#include "i2c.h"

/*----------------------------------------------------------------------------
Функции
-----------------------------------------------------------------------------*/

/**----------------------------------------------------------------------------
Delay()
-------------------------------------------------------------------------------
Задержка на время порядка 25 мкс.

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
static void Delay(void)
{
char ch=0;

while(ch++ < 2);
}

/**----------------------------------------------------------------------------
SendByte()
-------------------------------------------------------------------------------
Посылка по I2C байта (8 бит) и ожидание подтверждения (acknowledge).

Вход: uchar ch - байт, который нужно послать.
Выход: нет
Результат: 0 - подтверждение (acknowledge) получено
1 - не было подтверждения
----------------------------------------------------------------------------- */
static bit SendByte(unsigned char ch)//Returns ack (0 = acknowledged)
{
char cnt;
bit ack;

MDE=1;//Output
MCO=0;
for(cnt=0; cnt<8; cnt++,ch<<=1)
{
MDO=(ch&0x80)?1:0;
MCO=1;
Delay();
MCO=0;
}
MDE=0;//Input
MCO=1;
Delay();
ack=MDI;
MCO=0;
return ack;
}

/**----------------------------------------------------------------------------
Start()
-------------------------------------------------------------------------------
Установка состояния Start интерфейса i2c.

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
static void Start(void)
{
MDE=1;//Output
MDO=1;
MCO=1;
Delay();
MDO=0;
Delay();
MCO=0;
}

/**----------------------------------------------------------------------------
Stop()
-------------------------------------------------------------------------------
Установка состояния Stop интерфейса i2c.

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
static void Stop(void)
{
    MDE=1;//Output
    MCO=0;
    MDO=0;
    MCO=1;
    Delay();
    MDO=1;
    Delay();
    MDE=0;//Input (release line)
}


/**----------------------------------------------------------------------------
Begin()
-------------------------------------------------------------------------------
Начало сессии на интерфейсе i2c (Start + посылка i2c-адреса slave-устройства).

Вход: uchar addr - i2c-адрес slave-устройства 
Выход: нет
Результат: 0 - устройство откликнулось (получено acknowledge)
1 - устройство не откликнулось
----------------------------------------------------------------------------- */
static bit Begin(unsigned char addr)//Returns ack (0 = acknowledged)
{
Start();
return SendByte(addr);
}

/**----------------------------------------------------------------------------
Ack()
-------------------------------------------------------------------------------
Посылка подтверждения (acknowledge) устройству.

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
static void Ack(void)//Sends ack
{
    MDE=1; //Output
    MCO=0;
    MDO=0;
    MCO=1;
    Delay();
    MCO=0;
}

/**----------------------------------------------------------------------------
Nack()
-------------------------------------------------------------------------------
Посылка "неподтверждения" (not acknowledged) устройству.

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
static void Nack(void)//Sends NAck
{
    MDE=1;
    MCO=0;
    MDO=1;
    MCO=1;
    Delay();
    MCO=0;
}

/**----------------------------------------------------------------------------
GetAck()
-------------------------------------------------------------------------------
Проверка на готовность slave-устройства к обмену (начало + получение отклика +
завершение сессии)

Вход: нет
Выход: нет
Результат: нет
----------------------------------------------------------------------------- */
bit GetAck(unsigned char address) //Returns 1 if there was an ACK
{
    I2CM=1; //I2C Master mode
    if( Begin(address&0xFE) ){Stop();return 0;}
    Stop();

    return 1;
}


/**----------------------------------------------------------------------------
RecvByte()
-------------------------------------------------------------------------------
Получение 8 бит с шины данных i2c без подтверждения или неподтверждения приема.

Вход: нет
Выход: нет
Результат: принятые 8 бит.
----------------------------------------------------------------------------- */
unsigned char RecvByte(void)
{
    char cnt;
    unsigned char ch=0;

    MDE=0;//Input
    MCO=0;
    for(cnt=0; cnt<8; cnt++)
    {
        ch<<=1;
        MCO=1;
        Delay();
        ch|=MDI;
        MCO=0;
    }
    return ch;
}

/**----------------------------------------------------------------------------
ReceiveBlock()
-------------------------------------------------------------------------------
Получение блока данных от i2c-устройства с 8-разрядным внутренним адресным 
пространством. Принятый блок помещается в область памяти xdata.

Вход: uchar address - I2C-адрес устройства;
uchar addr - адрес во внутреннем адресном пространстве устройства;
uchar *block - адрес в области xdata, куда будет помещен принятый
блок данных;
uchar len - длина принимаемого блока.

Выход: нет
Результат: 0 - успешно;
1 - устройство не откликается.
----------------------------------------------------------------------------- */
bit ReceiveBlock(unsigned char address, unsigned char addr, unsigned char xdata * block,unsigned char len)
{ //addr - address in target
    unsigned char l,ch;

    I2CM=1; //I2C Master mode
    address=(address&0xFE); //Write

    if(Begin(address)){Stop();return 1;}//Error - No ACK
    if(SendByte(addr)){Stop();return 1;}
    Delay();
    Delay();

    address=(address|1);//Read
    if(Begin(address)) {Stop();return 1;}
    Delay();

    if(len-1)
    {
        for(l=0;l<(len-1);l++)
        {
            ch=RecvByte();
            Ack();
            *block++=ch;
        }
    }

    ch=RecvByte();
    Nack();
    *block=ch;
    Stop();
    return 0;
}

/**----------------------------------------------------------------------------
SendBlock()
-------------------------------------------------------------------------------
Запись блока данных во внутреннюю память i2c-устройства с 8-разрядным адресным 
пространством. 

Вход: uchar address - I2C-адрес устройства;
uchar addr - адрес во внутреннем адресном пространстве устройства,
куда будет помещен блок;
uchar *block - адрес в области xdata, где располагаются данные для 
пересылки;
uchar len - длина записываемого блока.

Выход: нет
Результат: 0 - успешно;
1 - устройство не откликается.
----------------------------------------------------------------------------- */
bit TransmitBlock(unsigned char address, unsigned char addr, unsigned char xdata * block,unsigned char len)
{ //addr - address in target
    unsigned char ch,l;

    I2CM=1; //I2C Master mode
    address=(address&0xFE); //Write
    if(Begin(address)) {Stop();return 1;}//Error - no Ack
    if(SendByte(addr)) {Stop();return 1;}

    for(l=0; l<len; l++,block++)
    {
        ch=*block;
        if(SendByte(ch)){ Stop(); return 1;}//Not to the end of the block
    }
    Stop();
    return 0;
}
